Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 227, 227, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 114, 114, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 114, 114, 64)      18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 57, 57, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 57, 57, 128)       73856     
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 114, 114, 128)     0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 114, 114, 64)      73792     
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 228, 228, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 228, 228, 32)      18464     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 227, 227, 3)       387       
=================================================================
Total params: 185,891
Trainable params: 185,891
Non-trainable params: 0
_________________________________________________________________